ERP DEV.WMS/src/Catalogs/вмс_НаборыДополнительныхРеквизитов/вмс_НаборыДополнительныхРеквизитов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_НаборыДополнительныхРеквизитов</name>
  <hierarchical>true</hierarchical>
  <tabularSections>
    <name>Владельцы</name>
    <attributes>
      <name>Владелец</name>
      <type>
        <types>CatalogRef.вмс_Контейнеры</types>
        <types>CatalogRef.вмс_ПравилаЗаполненияЗадачиКладовщику</types>
        <types>CatalogRef.вмс_Операции</types>
        <types>CatalogRef.вмс_ВидыПартийТоваров</types>
        <types>CatalogRef.вмс_НастройкиОператора</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.вмс_ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP DEV.WMS/src/Catalogs/вмс_НаборыДополнительныхРеквизитов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция глОбщийМодуль(ИмяМодуля)
	Возврат вмс_ОбщегоНазначенияКлиентСервер.ОбщийМодуль(ИмяМодуля);
КонецФункции

Функция ПолучитьЗапросПоНаборамОбъектов(Объекты, ИмяВременнойТаблицы=Неопределено, ДобавлятьНаборыРеквизитовВладельцев=Истина) Экспорт
	
	Перем ОбщегоНазначенияСервер;
	
	ОбщегоНазначенияСервер = глОбщийМодуль("ОбщегоНазначенияСервер");
	
	ТаблицаБлизостиЭлементов = ПолучитьТаблицуБлизостиОбъектов(Объекты, ДобавлятьНаборыРеквизитовВладельцев);
	
	Запрос = Новый Запрос;

	ТекстЗапроса = "";
	
	ТаблицаИменТипов = ТаблицаБлизостиЭлементов.Скопировать();
	ТаблицаИменТипов.Свернуть("ИмяТипа");
	МассивИменТипов = ТаблицаИменТипов.ВыгрузитьКолонку("ИмяТипа");
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияСервер.ПолучитьТекстЗапросаПустыхСсылокТиповОбъектов(МассивИменТипов, "ТаблицаПустыхСсылок") + Символы.ПС + ";" + Символы.ПС + Символы.ПС;
	
	ТекстЗапроса = ТекстЗапроса +
	"ВЫБРАТЬ
	|	ТаблицаБлизостиЭлементов.Элемент КАК Элемент,
	|	ТаблицаБлизостиЭлементов.Предок КАК Предок,
	|	ТаблицаБлизостиЭлементов.ИмяТипа КАК ИмяТипа
	|ПОМЕСТИТЬ ТаблицаБлизостиЭлементов
	|ИЗ
	|	&ТаблицаБлизостиЭлементов КАК ТаблицаБлизостиЭлементов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаБлизостиЭлементов.Элемент КАК Объект,
	|	ТаблицаБлизостиЭлементов.Предок КАК Владелец
	|ПОМЕСТИТЬ ТаблицаВладельцев
	|ИЗ
	|	ТаблицаБлизостиЭлементов КАК ТаблицаБлизостиЭлементов";
	
	/////////////////////////////////////////////////////////////////////////////////////////////////////
	ТекстЗапроса = ТекстЗапроса + Символы.ПС + ";" + Символы.ПС + Символы.ПС +
	
	"ВЫБРАТЬ
	|	ТаблицаВладельцев.Объект КАК Объект,
	|	вмс_НаборыДополнительныхРеквизитовВладельцы.Ссылка КАК Набор,
	|	ВЫБОР
	|		КОГДА ТаблицаВладельцев.Объект = ТаблицаВладельцев.Владелец
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Порядок
	|ПОМЕСТИТЬ НаборыСвойствОбъектов1
	|ИЗ
	|	ТаблицаВладельцев КАК ТаблицаВладельцев
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.вмс_НаборыДополнительныхРеквизитов.Владельцы КАК вмс_НаборыДополнительныхРеквизитовВладельцы
	|		ПО ТаблицаВладельцев.Владелец = вмс_НаборыДополнительныхРеквизитовВладельцы.Владелец
	|ГДЕ
	|	НЕ ТаблицаВладельцев.Владелец В
	|				(ВЫБРАТЬ
	|					ТаблицаПустыхСсылок.ПустаяСсылка
	|				ИЗ
	|					ТаблицаПустыхСсылок)
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ТаблицаБлизостиЭлементов.Элемент,
	|	вмс_НаборыДополнительныхРеквизитовВладельцы.Ссылка,
	|	2
	|ИЗ
	|	ТаблицаБлизостиЭлементов КАК ТаблицаБлизостиЭлементов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПустыхСсылок КАК ТаблицаПустыхСсылок
	|		ПО ТаблицаБлизостиЭлементов.ИмяТипа = ТаблицаПустыхСсылок.ИмяТипа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.вмс_НаборыДополнительныхРеквизитов.Владельцы КАК вмс_НаборыДополнительныхРеквизитовВладельцы
	|		ПО (ТаблицаПустыхСсылок.ПустаяСсылка = вмс_НаборыДополнительныхРеквизитовВладельцы.Владелец)
	|ГДЕ
	|	ТаблицаБлизостиЭлементов.Элемент = ТаблицаБлизостиЭлементов.Предок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вмс_НаборыДополнительныхРеквизитов.Ссылка КАК Набор,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ вмс_НаборыДополнительныхРеквизитовВладельцы.Владелец) КАК КоличествоВладельцев
	|ПОМЕСТИТЬ НаборыСвойствОбъектов2
	|ИЗ
	|	Справочник.вмс_НаборыДополнительныхРеквизитов КАК вмс_НаборыДополнительныхРеквизитов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.вмс_НаборыДополнительныхРеквизитов.Владельцы КАК вмс_НаборыДополнительныхРеквизитовВладельцы
	|		ПО вмс_НаборыДополнительныхРеквизитов.Ссылка = вмс_НаборыДополнительныхРеквизитовВладельцы.Ссылка
	|ГДЕ
	|	НЕ вмс_НаборыДополнительныхРеквизитов.ПометкаУдаления
	|	И вмс_НаборыДополнительныхРеквизитов.Ссылка В
	|			(ВЫБРАТЬ
	|				НаборыСвойствОбъектов1.Набор КАК Набор
	|			ИЗ
	|				НаборыСвойствОбъектов1 КАК НаборыСвойствОбъектов1)
	|
	|СГРУППИРОВАТЬ ПО
	|	вмс_НаборыДополнительныхРеквизитов.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НаборыСвойствОбъектов1.Объект КАК Объект,
	|	НаборыСвойствОбъектов1.Набор КАК Набор,
	|	НаборыСвойствОбъектов1.Порядок КАК ПорядокНабора,
	|	НаборыСвойствОбъектов2.КоличествоВладельцев КАК КоличествоВладельцевНабора,
	|	&ИмяВременнойТаблицы КАК ИмяВременнойТаблицы
	|ИЗ
	|	НаборыСвойствОбъектов1 КАК НаборыСвойствОбъектов1
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НаборыСвойствОбъектов2 КАК НаборыСвойствОбъектов2
	|		ПО НаборыСвойствОбъектов1.Набор = НаборыСвойствОбъектов2.Набор";
	
	Привязка = "," + Символы.ПС + Символы.Таб + "&ИмяВременнойТаблицы КАК ИмяВременнойТаблицы";
	Если ЗначениеЗаполнено(ИмяВременнойТаблицы) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, Привязка, Символы.ПС + "ПОМЕСТИТЬ " + ИмяВременнойТаблицы);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, Привязка, "");
	КонецЕсли;

	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ТаблицаБлизостиЭлементов", ТаблицаБлизостиЭлементов);
	
	Возврат Запрос;
	
КонецФункции

Функция ПолучитьТаблицуБлизостиОбъектов(Объекты, знач ДобавлятьНаборыРеквизитовВладельцев)
	
	Перем РК, ОбщегоНазначенияСервер, ОбщегоНазначенияВызовСервера, УправлениеСвойствамиВызовСервераПовтИсп;
	
	РК = глОбщийМодуль("РаботаСКоллекциями");
	ОбщегоНазначенияСервер = глОбщийМодуль("ОбщегоНазначенияСервер");
	ОбщегоНазначенияВызовСервера = глОбщийМодуль("ОбщегоНазначенияВызовСервера");
	УправлениеСвойствамиВызовСервераПовтИсп = глОбщийМодуль("УправлениеСвойствамиВызовСервераПовтИсп");
	
	МассивОбъектов = РК.ЗначениеВМассив(Объекты);
	
	МассивСсылокОбъектов = Новый Массив;
	Для Каждого Объект Из МассивОбъектов Цикл
		Если ОбщегоНазначенияВызовСервера.ЭтоСсылкаОбъектаИБ(Объект) Тогда
			МассивСсылокОбъектов.Добавить(Объект);
		Иначе
			МассивСсылокОбъектов.Добавить(Объект.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	КоличествоОсновныхОбъектов = МассивСсылокОбъектов.Количество();
	
	Если ДобавлятьНаборыРеквизитовВладельцев Тогда
		ТаблицаИменТиповОбъектов = ОбщегоНазначенияСервер.ПолучитьТаблицуИменТиповОбъектов(МассивСсылокОбъектов);
		ТаблицаИменТипов = ТаблицаИменТиповОбъектов.Скопировать();
		ТаблицаИменТипов.Свернуть("ИмяТипа");
		
		Запрос = Новый Запрос;
		
		ТекстЗапроса = "";
		ТекстШаблонаЗапросаНаборовПоРеквизитуВладельцев =
		"ВЫБРАТЬ
		|	ТаблицаОбъекта.Ссылка КАК Объект,
		|	ТаблицаОбъекта.Вид КАК Владелец
		|ИЗ
		|	Справочник.вмс_Контейнеры КАК ТаблицаОбъекта
		|ГДЕ
		|	ТаблицаОбъекта.Ссылка В(&МассивОбъектов)";
		
		НомерТипа = 0;
		Для Каждого СтрокаТипа Из ТаблицаИменТипов Цикл
			ИмяТипа = СтрокаТипа.ИмяТипа;
			РеквизитыВладельцев = УправлениеСвойствамиВызовСервераПовтИсп.ПолучитьРеквизитыВладельцевДополнительныхРеквизитов(ИмяТипа);
			Если РеквизитыВладельцев.Количество()=0 Тогда
				Продолжить;
			КонецЕсли;
			МассивОбъектовПоТипу = РК.ВыгрузитьЗначенияКолонкиКоллекции(ТаблицаИменТиповОбъектов.НайтиСтроки(Новый Структура("ИмяТипа", ИмяТипа)), "Объект");
			ИмяПараметраМассивОбъектов = "МассивОбъектов" + Формат(НомерТипа, "ЧГ=0");
			Запрос.УстановитьПараметр(ИмяПараметраМассивОбъектов, МассивОбъектовПоТипу);
			Для Каждого РеквизитВладельцев Из РеквизитыВладельцев Цикл
				ТекстЗапросаНаборовПоРеквизитуВладельцев = ТекстШаблонаЗапросаНаборовПоРеквизитуВладельцев;
				ТекстЗапросаНаборовПоРеквизитуВладельцев = СтрЗаменить(ТекстЗапросаНаборовПоРеквизитуВладельцев, "Справочник.вмс_Контейнеры", ИмяТипа);
				ТекстЗапросаНаборовПоРеквизитуВладельцев = СтрЗаменить(ТекстЗапросаНаборовПоРеквизитуВладельцев, "ТаблицаОбъекта.Вид", "ТаблицаОбъекта." + РеквизитВладельцев);
				ТекстЗапросаНаборовПоРеквизитуВладельцев = СтрЗаменить(ТекстЗапросаНаборовПоРеквизитуВладельцев, "&МассивОбъектов", "&" + ИмяПараметраМассивОбъектов);
				Если ТекстЗапроса <> "" Тогда
					ТекстЗапроса = ТекстЗапроса + Символы.ПС + Символы.ПС + "ОБЪЕДИНИТЬ" + Символы.ПС + Символы.ПС;
				КонецЕсли;
				ТекстЗапроса = ТекстЗапроса + ТекстЗапросаНаборовПоРеквизитуВладельцев;
			КонецЦикла;
			НомерТипа = НомерТипа + 1;
		КонецЦикла;
		
		Если ТекстЗапроса <> "" Тогда
			Запрос.Текст = ТекстЗапроса;
			ТаблицаВладельцев = Запрос.Выполнить().Выгрузить();
			Владельцы = ТаблицаВладельцев.ВыгрузитьКолонку("Владелец");
			Для Каждого Владелец Из Владельцы Цикл
				Если МассивСсылокОбъектов.Найти(Владелец)=Неопределено Тогда
					МассивСсылокОбъектов.Добавить(Владелец);
				КонецЕсли;
			КонецЦикла;
		Иначе
			ДобавлятьНаборыРеквизитовВладельцев = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ТаблицаБлизостиЭлементов = ОбщегоНазначенияСервер.ПолучитьТаблицуБлизостиЭлементов(МассивСсылокОбъектов);
	
	Если ДобавлятьНаборыРеквизитовВладельцев Тогда
		// скопируем иерархию владельцев
		Для Каждого СтрокаВладельца Из ТаблицаВладельцев Цикл
			СтрокиБлизостиЭлемента = ТаблицаБлизостиЭлементов.НайтиСтроки(Новый Структура("Элемент", СтрокаВладельца.Объект));
			Если СтрокиБлизостиЭлемента.Количество()=0 Тогда
				Продолжить;
			КонецЕсли;
			СтрокаБлизостиЭлемента = СтрокиБлизостиЭлемента[0];
			СтрокиБлизостиВладельца = ТаблицаБлизостиЭлементов.НайтиСтроки(Новый Структура("Элемент", СтрокаВладельца.Владелец));
			
			Для Каждого СтрокаБлизостиВладельца Из СтрокиБлизостиВладельца Цикл
				СтрокаБлизостиЭлементаПоИерархииВладельца = ТаблицаБлизостиЭлементов.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаБлизостиЭлементаПоИерархииВладельца, СтрокаБлизостиЭлемента);
				СтрокаБлизостиЭлементаПоИерархииВладельца.Предок = СтрокаБлизостиВладельца.Предок;
			КонецЦикла;
		КонецЦикла;
		
		// удалим дополнительные объекты
		Для НомерОбъекта=КоличествоОсновныхОбъектов По МассивСсылокОбъектов.Количество()-1 Цикл
			Элемент = МассивСсылокОбъектов[НомерОбъекта];
			РК.УдалитьЭлементыКоллекции(ТаблицаБлизостиЭлементов, ТаблицаБлизостиЭлементов.НайтиСтроки(Новый Структура("Элемент", Элемент)));
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТаблицаБлизостиЭлементов;
	
КонецФункции

Функция НайтиНаборПоВладельцу(Владелец, ДобавлятьНаборыРеквизитовВладельцев=Истина) Экспорт
	
	НаборыДанных = НайтиНаборыПоВладельцу(Владелец, ДобавлятьНаборыРеквизитовВладельцев);
	
	Если НаборыДанных.Количество() > 0 Тогда
		Возврат НаборыДанных[0];
	КонецЕсли;
	
КонецФункции

Функция НайтиНаборыПоВладельцу(Владелец, ДобавлятьНаборыРеквизитовВладельцев=Истина) Экспорт
	
	ЗапросПоНаборамОбъектов = ПолучитьЗапросПоНаборамОбъектов(Владелец, , ДобавлятьНаборыРеквизитовВладельцев);
	РезультатЗапроса = ЗапросПоНаборамОбъектов.Выполнить();
	ТаблицаПоНаборамОбъектов = РезультатЗапроса.Выгрузить();
	ТаблицаПоНаборамОбъектов.Сортировать("ПорядокНабора, КоличествоВладельцевНабора");
	НаборыОбъектов = ТаблицаПоНаборамОбъектов.ВыгрузитьКолонку("Набор");
	
	Возврат НаборыОбъектов;
	
КонецФункции

#КонецЕсли
